qu_list = {}

qu_list["嘉兴"] = {
	cmd="fly jx;",
	rooms={
		{
			path="",
			desc=[[    烟雨楼建在南湖中心的一个小岛上。南湖终年不断的水气把它
笼罩得迷迷蒙蒙的。楼内是家饭店。
店内正在装修楼梯。请勿上楼。]]
		},

		{
			path="u;",
			desc=[[    烟雨楼在南湖畔，四望临风，醺醺醉人。柳岸翻曳，禽噪起伏。
湖面轻烟薄雾，几尾小舟荡漾其间。半湖水里都浮着碧油油的菱叶，
越女轻歌，娇痴无那。
    你放眼观赏，直欲跳入她的怀中。

    楼中立了一幅长匾(bian)，绞丝镶边，楠木为里，年代虽久，
桐油粉漆，犹自清新如昨。柱子上隐隐有些字迹（ziji）。]]
		},

		{
			path="n;",
			desc=[[    这里是烟波浩淼的南湖。湖上几只画舫在游荡，船上的游客和
青楼女子在嘻笑。湖水很深，没有船是渡不过去的。但不知是谁在
湖底钉了一些木桩。桩顶潜在水面之下一两寸的地方。即使是不懂
轻功的人走上去也像是水上漂的样子。似乎水下有了些什么. 近来
有人潜(out)下湖去搜寻什么, 总也不知道结果如何. 只是有人传
闻在湖底找到了什么宝贝.]]
		},

		{
			path="n;nw;",
			desc=[[    这里是嘉兴南湖。节近中秋，荷叶渐残，莲肉饱实。一阵轻柔
婉转的歌声，飘在烟水蒙蒙的湖面上。湖边一个道姑在一排柳树下
悄立已久。]]
		},

		{
			path="n;nw;e;",
			desc=[[    这里是嘉兴海港，港内白帆点点，码头上停着好多渔船，可是
一提起桃花岛却个个摇头。]]
		},

		{
			path="n;nw;w;",
			desc=[[    这里是江南名城嘉兴。城东是风景如画的南湖。城北早先有座醉仙楼，
当年全真七子之一的丘处机和江南七怪就在那里盟约寻找忠良之后。不知
道什么原因店主把它迁到扬州了。]]
		},

		{
			path="n;nw;s;",
			desc=[[    这铁枪庙祀奉的是五代时名将铁枪王彦章。庙旁有座高塔，塔顶
群鸦世代为巢，当地乡民传说铁枪庙的乌鸦是神兵神将，向来不敢侵
犯，以致生养繁殖，越来越多。案桌下有个小洞(dong)。]]
		},
		{
			path="n;nw;s;w;",
			desc=[[    这里是嘉兴的南门。周围长着茂密的竹林。东面是座庙宇。
向南可入福建。向西南就是号称天堂的杭州城了。]]
		},
		{
			path="n;nw;s;w;n;",
			desc=[[    这里是江南名城嘉兴。城东是风景如画的南湖。城北早先有座醉仙楼，
当年全真七子之一的丘处机和江南七怪就在那里盟约寻找忠良之后。不知
道什么原因店主把它迁到扬州了。]]
		},
		{
			path="n;nw;s;w;n;nw;",
			desc=[[    你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。
东面是江南名城嘉兴。西边望去，波光粼闪，白帆点缀，便是周遭五百里
的太湖了。]]
		},
		{
			path="n;nw;s;w;n;nw;s;",
			desc=[[    你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。]]
		},
		{
			path="fly jx;n;nw;s;w;n;nw;s;s;",
			desc=[[    你走在一条山路上。时值春日，路旁的山坡上开满了金黄色的油菜花。]]
		},
		{
			path="n;nw;s;w;n;nw;s;s;",
			desc=[[    富庶的杭嘉湖平原。]]
		}
	}
}


qu_list["北京紫禁城"] = {
	cmd="fly bj",
	rooms={
		{
			path="n;", desc=[[    这是一座破旧的石桥，桥下是护城河缓缓的流水。水看上去很清，
据说曾有人在这里跳河(out)。这里是进皇宫正门的必经之路。]]
		},
		{
			path="n;w;", desc=[[    这里是小桥西侧，一股寒风吹过，冷得你瑟瑟发抖，只想离开。]]
		},
		{
			path="n;e;", desc=[[    这里是小桥东侧，一股寒风吹过，冷得你瑟瑟发抖，只想离开。]]
		},
		{
			path="n;n;",desc=[[    这便是皇宫正门。巍峨雄伟的城墙上，'紫禁城'三个大字十分显眼，
气势辉煌。一张镶金边的告示(gaoshi)贴在墙上，许多官兵立在两旁。]]
		},
		{
			path="n;n;n;",desc=[[    这里是清和殿。西边是一条长长的走廊，通往后院。走廊上有几间卧房，
那里是宫中太监的住所。]]
		},
		{
			path="#3 n;w;", desc=[[    这里是清和殿。西边是一条长长的走廊，通往后院。走廊上有几间卧房，
那里是宫中太监的住所。]]
		},
		{
			path="#3 n;#2 w;", desc=[[    这里是清和殿后院。院里种着些青菜。墙角有一口水井(well)。
站在水井边往下看，只觉深不见底，井壁上满是滑溜溜的青苔。一个
轱辘吊着一根长绳，绳端系着一个木桶。东边是一条走廊，通往清和
殿。]]
		},
		{
			path="#3 n;w;n;", desc=[[    这里是一间小屋，一个太监正在这里休息。]]
		},
		{
			path="#3 n;w;s;", desc=[[    这里是一间小屋，一个太监正在休息。]]
		},
		{
			path="#3 n;e;", desc=[[    皇宫里的膳食与平常民间的自然不同，这里就是负责皇上用膳的御
膳房。你不禁想把这里的美味都尝一遍，可别忘了这可是皇宫啊。]]
		},
		{
			path="#4 n;", desc=[[    飞檐雕栏的厅廊。两边是喜人的花草，站在这儿，隐约听得到后宫里
嫔妃宫女们嬉笑的声音，宫里的人来来往往的，显得井井有条，看来宫里
的规矩挺严的。]]
		},
		{
			path="#5 n;", desc=[[    飞檐雕栏的厅廊。两边是喜人的花草，站在这儿，隐约听得到后宫里
嫔妃宫女们嬉笑的声音，宫里的人来来往往的，显得井井有条，看来宫里
的规矩挺严的。有几个官员神情紧张地站在这儿，等着皇上召见。]]
		},
		{
			path="#6 n;", desc=[[    皇上用功读书的御书房。四下齐整地排着几排书架，看来都是些名典
巨著，你暗自道，原来皇上也读这么多书啊。书房正中有张精雕的檀香木
桌，桌上摆着几本封面精美的帛书。]]
		},
		{
			path="#4 n;w;", desc=[[    飞檐雕栏的厅廊。两边是喜人的花草，站在这儿，隐约听得到后宫里
嫔妃宫女们嬉笑的声音，宫里的人来来往往的，显得井井有条，看来宫里
的规矩挺严的。]]
		},
		{
			path="#4 n;w;n;",desc=[[    这里是皇上赏花的后花苑。平日里皇上时常会来这儿，和贵妃娘娘
一起赏花品茗。所以，这儿是平常太监，侍卫不能来的。这里的宫女多是
心灵手巧，精通花道的。放眼四顾，满目皆是似锦繁花，你仔细分辨,竟
然品目齐全，大凡你想得的，甚至你想都不敢想的,这里都有了。你不经
有些妒疾起皇帝老儿来。北边有一条小径通往一处寝宫。]]
		},
		{
			path="#4 n;w;n;w;",desc=[[    这里是皇上赏花的后花苑。平日里皇上时常会来这儿，和贵妃娘娘
一起赏花品茗。所以，这儿是平常太监，侍卫不能来的。这里的宫女多是
心灵手巧，精通花道的。放眼四顾，满目皆是似锦繁花，你仔细分辨,竟
然品目齐全，大凡你想得的，甚至你想都不敢想的,这里都有了。你不经
有些妒疾起皇帝老儿来。]]
		},
		{
			path="#4 n;w;n;w;w;",desc=[[    皇家马圈，自然是好马云集。一排排齐整的马厩，一匹匹英挺
高头俊马，让你不由想起大草原上万马奔腾的壮伟景象。]]
		},
		{
			path="n;out;",desc=[[    这是一口极深的水井。浮在水面往上看，只觉得圆圆的天空是那么可
爱。井壁(wall)上满是滑溜溜的青苔。一个轱辘吊着一根长绳(string)，
绳端系着一个木桶(mutong)。木桶悬在空中，离你很近，只差一点就可
以够得着。]]
		}
	}
}



function serialize(t)
	local mark={}
	local assign={}

	local function ser_table(tbl,parent)
		mark[tbl]=parent
		local tmp={}
		for k,v in pairs(tbl) do
			local key= type(k)=="number" and "["..k.."]" or k
			if type(v)=="table" then
				local dotkey= parent..(type(k)=="number" and key or "."..key)
				if mark[v] then
					table.insert(assign,dotkey.."="..mark[v])
				else
					table.insert(tmp, key.."="..ser_table(v,dotkey))
				end
			else
				table.insert(tmp, key.."="..v)
			end
		end
		return "{"..table.concat(tmp,",").."}"
	end

	return ser_table(t,"ret")..table.concat(assign," ")
end

print(serialize(qu_list))


return qu_list
